In [1]:
import pandas as pd
import numpy as np
from pydataset import data
from env import host, username, password
np.random.seed(123)

In [ ]:
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

In [ ]:
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [ ]:
df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [ ]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

In [ ]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

In [ ]:
data()

In [ ]:
mpg = data('mpg')

In [2]:

def get_db_url(db):
    from env import host, username, password
    '''
    return a formatted string containing username, password
    host and database for connecting to the mySQL server and the
    database indicated.
    
    env_file checks to see if the env.py exists in cwd
    
    '''
    username, password, host = (username, password, host)
    
    return f"mysql+pymysql://{username}:{password}@{host}/{db}"

In [3]:
# SQL SETUP VARIABLES
url_chipotle = get_db_url("chipotle")
query_chipotle = '''
SELECT
    *
FROM orders

LIMIT 10;
'''
dataframe_chipotle = pd.read_sql(query_chipotle, url_chipotle)

In [ ]:
from env import host, username, password

# EXERCISES I

In [4]:
url_employees = get_db_url('employees')

In [6]:
query_employees = '''
SELECT *
FROM employees;
'''
df_employees = pd.read_sql(query_employees, url_employees)
df_employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [7]:
query_titles = '''
SELECT *
FROM titles;
'''

df_titles = pd.read_sql(query_titles, url_employees)
df_titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [ ]:
query_unique_titles = '''
SELECT DISTINCT title
FROM titles;
'''

unique_titles = pd.read_sql(query_unique_titles, url_employees)
unique_titles

In [ ]:
oldest_date = '''
SELECT to_date
FROM titles;
'''

df_oldest = pd.read_sql(oldest_date, url_employees)
df_oldest.min()

In [ ]:
newest_date = '''
SELECT from_date
FROM titles;
'''

df_newest = pd.read_sql(newest_date, url_employees)
df_newest.max()

# EXERCISES II

1. Copy the users and roles DataFrames from the examples above.

In [ ]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

In [ ]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

2. What is the result of using a right join on the DataFrames?

In [ ]:
users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)

3. What is the result of using an outer join on the DataFrames?

In [ ]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

In [ ]:
#Changing column names and cleaning up the result of the join
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
#you'd get an error

5. Load the mpg dataset from PyDataset.

In [ ]:
mpg

6. Output and read the documentation for the mpg dataset.

In [ ]:
data('mpg', show_doc=True)

7. How many rows and columns are in the dataset?

In [ ]:
mpg.shape

8. Check out your column names and perform any cleanup you may want on them.

In [ ]:
mpg.columns
mpg = mpg.rename(columns={'cty': 'city', 
                     'hwy': 'highway',
                     'class': 'variety'}
            )
mpg.columns

9. Display the summary statistics for the dataset.

In [ ]:
mpg.describe()

10. How many different manufacturers are there?

In [ ]:
#mpg.manufacturer.nunique()
#mpg.manufacturer.drop_duplicates().count()

mpg.manufacturer.value_counts().count()

11. How many different models are there?

In [ ]:
#mpg.model.nunique()
#mpg.model.drop_duplicates().count()
mpg.model.value_counts().count()

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [ ]:
mpg['mileage_difference'] = mpg.highway - mpg.city
mpg

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
mpg['average_mileage'] = (mpg.highway + mpg.city) / 2
mpg

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
#mpg['is_automatic'] = (mpg.trans != 'manual(m5)') & (mpg.trans != 'manual(m6)')

mpg['is_automatic'] = mpg.trans.str.startswith('a')
mpg

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
#mpg.groupby('manufacturer')['average_mileage'].agg('mean')
mpg.groupby('manufacturer')['average_mileage'].mean().sort_values(ascending = False)

In [ ]:
mpg.groupby('manufacturer')['average_mileage'].mean().nlargest(2)

16. Do automatic or manual cars have better miles per gallon?

In [ ]:
mpg.sort_values(['average_mileage', 'trans'], ascending = False)

In [ ]:
mpg.groupby('is_automatic')['average_mileage'].mean()

# Exercises III

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [ ]:
url_chipotle = get_db_url("chipotle")

In [ ]:
url_chipotle = get_db_url("chipotle")
query_chipotle = '''
SELECT
    *
FROM orders;
'''
df_chipotle = pd.read_sql(query_chipotle, url_chipotle)
df_chipotle.info()

2. What is the total price for each order?

In [ ]:
df_chipotle['item_price'] = df_chipotle['item_price'].str.replace('$', '').astype(float)

In [ ]:
df_chipotle.dtypes

In [ ]:
df_chipotle.groupby('order_id')['item_price'].sum()

3. What are the most popular 3 items?

In [ ]:
df_chipotle.groupby('item_name')['id'].count().nlargest(3)

4. Which item has produced the most revenue?

In [ ]:
df_chipotle.groupby('item_name')['item_price'].sum().nlargest(1)

5. Join the employees and titles DataFrames together.

In [9]:
df_employees.merge(df_titles, on = 'emp_no')

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [11]:
emp_title = df_employees.merge(df_titles, on = 'emp_no')

In [12]:
emp_title.groupby('title')['from_date'].agg('max')

title
Assistant Engineer    2000-02-01
Engineer              2002-08-01
Manager               1996-08-30
Senior Engineer       2002-08-01
Senior Staff          2002-08-01
Staff                 2000-02-01
Technique Leader      2000-02-01
Name: from_date, dtype: object

7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [13]:
cross_query = '''
            SELECT t.title, d.dept_name
            FROM dept_emp
            JOIN titles t USING(emp_no)
            JOIN departments d USING(dept_no)
            WHERE t.to_date > NOW();
            '''

In [15]:
cross_url = get_db_url('employees')

In [16]:
df_cross = pd.read_sql(cross_query, cross_url)

df_cross.head()

             title        dept_name
0  Senior Engineer      Development
1            Staff            Sales
2  Senior Engineer       Production
3  Senior Engineer       Production
4     Senior Staff  Human Resources

In [17]:
df_cross.shape

(265332, 2)

In [19]:
pd.crosstab(df_cross['title'], df_cross['dept_name'])

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,68,1833,0,0,0,1542,433,77,0
Engineer,627,15677,0,0,0,13325,3744,830,0
Manager,1,1,1,1,1,1,1,1,1
Senior Engineer,1790,43364,0,0,0,37156,10390,2250,0
Senior Staff,12349,1085,10650,10843,12371,1123,0,10219,32032
Staff,3902,315,3199,3416,3880,349,0,3206,9967
Technique Leader,241,6117,0,0,0,5210,1422,321,0